# -*- mode:org; org-confirm-babel-evaluate: nil; org-todo-keyword-faces: (("[0_TODO]" . "orange") ("[1_IP..]" . "yellow") ("[2_FIX.]" . "red") ("[3_WAIT]" . "blue") ("[4_NOPE]" . "black") ("[5_DONE]" . "green")); -*-
#+STARTUP: indent overview align
#+OPTIONS: toc:nil num:nil title:nil \n:t author:nil ::nil H:1 f:nil 
#+TITLE: devlog
#+AUTHOR: the untitled program
#+TODO: [0_TODO] [1_IP..] [2_FIX.] [3_WAIT] [4_NOPE] [5_DONE]
#+SUBTITLE: nope still got nothing for the name
#+NOTHING: goes here
*** spec
- convert org into datastructure
- link linked inputs and outputs
- correctly load taxbacklog.org under 1s
- make commandline test functions (as args) to:
  - check for hash conflicts
  - check and correct hash conflicts
  - examine contents of any heading(s) by name
  - examine contents of any heading by index
  - examine contents of any heading by id
  - query value of any item by its id
  - query value of any item by its path
  - query value of any linked item via its link
  - change value of any struct parameter via its id
  - change value of any struct parameter via its path
  - change value of any linked struct parameter via its link
  - add struct to any list via path
  - remove struct via its id
  - remove struct via its path
  - remove linked struct via its link
  - unlink linked struct via its link
  - unlink linked struct via its id
  - unlink linked struct via its path
  - sort listed structs by name
  - sort listed structs by value
  - move listed struct up by 1
  - move listed struct down by 1
  - correclty rename struct name that requires a unique name
  - evaluate a srcblock element, respecting all element params
  - correctly evaluate a srcblock and all upstream elements collecting and reversing, eg::
#+BEGIN_SRC vala
struct node {
	string	name;
	uint	id;
	uint[]	input;
}
node[] nodes;
void main (string[] args) {
node aa = node();
node bb = node();
node cc = node();
node dd = node();
aa.name = "aa";
aa.id = 1;
bb.name = "bb";
bb.id = 2;
cc.name = "cc";
cc.id = 3;
dd.name = "dd";
dd.id = 4;
cc.input += dd.id;
cc.input += aa.id;
dd.input += bb.id;
dd.input += aa.id;
bb.input += aa.id;
nodes += aa;
nodes += bb;
nodes += cc;
nodes += dd;

// aa -> bb -> dd -> cc
// aa -------------> cc
// aa -------> dd

//   00 01 02 | a  | b  | for (int i = a.length - 1; i >= 0; i--) {
// 0 aa       | aa | aa |    for (int q = 0; q < b.length; q++) {
// 0 dd       | dd | bb |        if (b[q] == a[i]) { allgood = false; break; }
// 1    bb    | bb | dd |    }
// 1    aa    | aa |    |    if (allgood) { b += a[i]; }
// 2       aa | aa |    | }
//
// = aa -> bb -> dd -> cc
// = 1  -> 2  -> 4

uint[] sl = {};
uint[] ul = {};
uint[] nn = nodes[2].input;
bool allgood = true;

print("cc.input[0] = %u, cc.input[1] = %u\n",nn[0],nn[1]);
int r = 0;
while (r < nn.length) {
	for (int f = 0; f < nn.length; f++) {
		for (int n = 0; n < nodes.length; n++) {
// if node in nn
			if (nodes[n].id == nn[f]) {
				for(int i = 0; i < nodes[n].input.length; i++) {
					nn += nodes[n].input[i];
				}
			}
		}
		r += 1;
	}
	if (r > 10) { break; }
}
uint[] ee = {};
for (int n = (nn.length - 1); n >= 0; n--) {
	allgood = true;
	for (int e = 0; e < ee.length; e++) {
		if (ee[e] == nn[n]) { allgood = false; break; }
	}
	if (allgood) { ee += nn[n]; }
}
for (int j = 0; j < ee.length; j++) { print("ee[%d] = %u\n",j,ee[j]); }
}
#+END_SRC

#+RESULTS:
: Compilation succeeded - 2 warning(s)
: cc.input[0] = 4, cc.input[1] = 1
: ee[0] = 1
: ee[1] = 2
: ee[2] = 4

